---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.FieldValues
source: html/3e40d231-4ab5-0d31-23fa-1b874e1a32fd.htm
---
# FieldValues Properties

Specifies whether the .NET object represents a valid Revit entity.